Repository: aleksandrbliznov/ServiceNEW2
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: et

source: Welcome to Service PRO
et: Tere tulemast Service PRO-sse

source: Find trusted professionals for all your home service needs.
et: Leidke usaldusväärseid professionaale kõigi teie kodu teenuste vajaduste jaoks.

source: Quality service at your fingertips!
et: Kvaliteetne teenindus teie käeulatuses!

source: Get Started
et: Alusta

source: Login
et: Logi sisse

source: Our Services
et: Meie teenused

source: View All Services
et: Vaata kõiki teenuseid

source: Book Service
et: Broneeri teenus

source: Please login to book services
et: Palun logige sisse teenuste broneerimiseks

source: About Service PRO
et: Service PRO kohta

source: We connect homeowners with trusted professional service providers
et: Me ühendame majaomanikke usaldusväärsete professionaalsete teenuseosutajatega

source: Our platform ensures quality, reliability, and peace of mind for all your home service needs.
et: Meie platvorm tagab kvaliteedi, usaldusväärsuse ja meelerahu kõigi teie kodu teenuste vajaduste jaoks.

source: Verified Professionals
et: Kontrollitud professionaalid

source: All service providers are background-checked and verified
et: Kõik teenuseosutajad on taustakontrollitud ja kinnitatud

source: Quality Guarantee
et: Kvaliteedi garantii

source: 100% satisfaction guarantee on all services
et: 100% rahulolu garantii kõigil teenustel

source: Fast Service
et: Kiire teenindus

source: Quick response times and flexible scheduling
et: Kiired reageerimisajad ja paindlik ajakava

source: 24/7 Support
et: 24/7 tugi

source: Round-the-clock customer support
et: Ööpäevaringne klienditugi

source: Learn More About Us
et: Lisateave meie kohta

source: What Our Customers Say
et: Mida meie kliendid ütlevad

source: Don't just take our word for it - hear from our satisfied customers
et: Ärge võtke meie sõna peale - kuulake meie rahulolevaid kliente

source: Ready to Get Started?
et: Valmis alustama?

source: Join thousands of satisfied customers and find your perfect service provider today
et: Liituge tuhandete rahulolevate klientidega ja leidke oma ideaalne teenuseosutaja juba täna

source: Contact Us
et: Võtke meiega ühendust

source: Home
et: Avaleht

source: Register
et: Registreeru

source: My Dashboard
et: Minu töölaud

source: Admin Panel
et: Admini paneel

source: My Jobs
et: Minu tööd

source: Logout
et: Logi välja

source: Manage Services
et: Halda teenuseid

source: My Services
et: Minu teenused

source: Add New Service
et: Lisa uus teenus

source: My Work Hours
et: Minu tööaeg

source: Service Groups Management
et: Teenuste rühmade haldamine

source: Add New Group
et: Lisa uus rühm

source: Add Work Hours
et: Lisa tööaeg

source: Add New Service Group
et: Lisa uus teenuste rühm

source: Service Name
et: Teenuse nimi

source: Description
et: Kirjeldus

source: Price
et: Hind

source: Duration (hours)
et: Kestus (tunnid)

source: Category
et: Kategooria

source: Add Service
et: Lisa teenus

source: Cancel
et: Tühista

source: Monday
et: Esmaspäev

source: Tuesday
et: Teisipäev

source: Wednesday
et: Kolmapäev

source: Thursday
et: Neljapäev

source: Friday
et: Reede

source: Saturday
et: Laupäev

source: Sunday
et: Pühapäev

source: Day
et: Päev

source: Start Time
et: Algusaeg

source: End Time
et: Lõpuaeg

source: Save Hours
et: Salvesta tunnid

source: My Feedback
et: Minu tagasiside

source: Back to Jobs
et: Tagasi tööde juurde

source: No comment provided.
et: Kommentaari ei ole esitatud.

source: Feedback Statistics
et: Tagasiside statistika

source: Total Reviews
et: Kokku arvustusi

source: Average Rating
et: Keskmine hinne

source: 5-Star Reviews
et: 5-tärni arvustused

source: 4+ Star Reviews
et: 4+ tärni arvustused

source: No feedback yet
et: Tagasisidet veel pole

source: You haven't received any feedback from customers yet.
et: Te pole veel klientidelt tagasisidet saanud.

source: Complete some jobs to start receiving reviews!
et: Tehke mõned tööd, et hakata arvustusi saama!

source: Booking Confirmation - Service PRO
et: Broneeringu kinnitus - Service PRO

source: Dear
et: Lugupeetud

source: Your booking has been placed successfully!
et: Teie broneering on edukalt esitatud!

source: Booking Details:
et: Broneeringu üksikasjad:

source: Service:
et: Teenus:

source: Date & Time:
et: Kuupäev ja kellaaeg:

source: Price:
et: Hind:

source: Status: Pending admin approval
et: Staatus: Ootab admini kinnitust

source: You will receive another email once your booking is approved and a handyman is assigned.
et: Te saate teise e-kirja, kui teie broneering on kinnitatud ja meister on määratud.

source: Thank you for using Service PRO!
et: Tänan, et kasutate Service PRO-d!

source: New Booking Placed - Service PRO
et: Uus broneering esitatud - Service PRO

source: New booking has been placed:
et: Uus broneering on esitatud:

source: Customer:
et: Klient:

source: Please review and approve this booking in the admin panel.
et: Palun vaadake läbi ja kinnitage see broneering admini paneelis.

source: Password Reset Request
et: Parooli lähtestamise taotlus

source: To reset your password, visit the following link:
et: Parooli lähtestamiseks külastage järgmist linki:

source: If you did not make this request, simply ignore this email.
et: Kui te ei teinud seda taotlust, lihtsalt ignoreerige seda e-kirja.

source: Password reset instructions have been sent to your email.
et: Parooli lähtestamise juhised on saadetud teie e-postile.

source: If an account with that email exists, a password reset link has been sent.
et: Kui selle e-postiga konto eksisteerib, on parooli lähtestamise link saadetud.

source: Error sending email. Please try again later.
et: Viga e-kirja saatmisel. Palun proovige hiljem uuesti.

source: Invalid or expired reset token.
et: Vigane või aegunud lähtestamise token.

source: Your password has been updated!
et: Teie parool on uuendatud!

source: Service
et: Teenus

source: Date & Time
et: Kuupäev ja kellaaeg

source: Actions
et: Tegevused

source: hours
et: tundi

source: to book services
et: teenuste broneerimiseks

source: No services available at the moment.
et: Hetkel teenuseid ei ole saadaval.

source: Add the first service
et: Lisa esimene teenus

source: Services
et: Teenused

source: Professional services for all your home maintenance needs
et: Professionaalsed teenused kõigi teie kodu hooldusvajaduste jaoks

source: Why Choose Service PRO?
et: Miks valida Service PRO?

source: We connect homeowners with trusted, professional service providers
et: Me ühendame majaomanikke usaldusväärsete professionaalsete teenuseosutajatega

source: All service providers are background-checked and verified for your peace of mind
et: Kõik teenuseosutajad on taustakontrollitud ja kinnitatud teie meelerahu jaoks

source: 100% satisfaction guarantee on all services with our quality assurance program
et: 100% rahulolu garantii kõigil teenustel meie kvaliteedi tagamise programmiga

source: Quick response times and flexible scheduling to fit your busy lifestyle
et: Kiired reageerimisajad ja paindlik ajakava teie kiire elustiili jaoks

source: Round-the-clock customer support to help you whenever you need assistance
et: Ööpäevaringne klienditugi, et aidata teid alati, kui vajate abi

source: Get Started Now
et: Alusta kohe

source: Manage your bookings and service requests
et: Halda oma broneeringuid ja teenuse taotlusi

source: No bookings yet
et: Broneeringuid veel pole

source: Browse All Services
et: Sirvi kõiki teenuseid

source: No recent activity
et: Hiljutist tegevust pole

source: Manage your Service PRO platform
et: Halda oma Service PRO platvormi

source: handyman registration(s) pending approval.
et: meistri registreerimine(id) ootab kinnitust.

source: No pending handyman approvals.
et: Ootel meistrite kinnitusi pole.

source: booking(s) waiting for approval.
et: broneering(ud) ootab kinnitust.

source: No pending bookings to review.
et: Ootel broneeringuid ülevaatamiseks pole.

source: Review Pending Users
et: Vaata ootel kasutajaid

source: Review Pending Bookings
et: Vaata ootel broneeringuid

source: All caught up!
et: Kõik on korras!

source: All set!
et: Kõik on valmis!

source: Name
et: Nimi

source: Duration
et: Kestus

source: Add First Service
et: Lisa esimene teenus

source: Update Service
et: Uuenda teenus

source: Edit
et: Muuda

source: Delete
et: Kustuta

source: Are you sure you want to delete this service?
et: Kas olete kindel, et soovite selle teenuse kustutada?

source: Active
et: Aktiivne

source: Inactive
et: Mitteaktiivne

source: No services found
et: Teenuseid ei leitud

source: No services have been created yet.
et: Ühtegi teenust pole veel loodud.

source: Edit Service
et: Muuda teenus

source: Starting Price
et: Alghind

source: Happy Customers
et: Rahulolevad kliendid

source: Happy Clients
et: Rahulolevad kliendid

source: Service Types
et: Teenuse tüübid

source: Professionals
et: Professionaalid

source: Get In Touch
et: Võtke ühendust

source: Have a question or need a custom service? Send us a message and we will get back to you soon.
et: Kas teil on küsimus või vajate kohandatud teenust? Saatke meile sõnum ja me võtame teiega peagi ühendust.

source: Full Name
et: Täisnimi

source: Email Address
et: E-posti aadress

source: Service Address
et: Teenuse aadress

source: Message
et: Sõnum

source: Describe your service needs...
et: Kirjeldage oma teenuse vajadusi...

source: Submit Request
et: Esita taotlus

source: Service Providers
et: Teenuseosutajad

source: Jobs Completed
et: Tööd tehtud

source: Your trusted platform connecting customers with professional service providers.
et: Teie usaldusväärne platvorm, mis ühendab kliente professionaalsete teenuseosutajatega.

source: Quality service at your fingertips.
et: Kvaliteetne teenindus teie käeulatuses.

source: All rights reserved.
et: Kõik õigused kaitstud.

source: Contact Email
et: Kontakt e-post

source: © 2024 Service PRO. All rights reserved.
et: © 2024 Service PRO. Kõik õigused kaitstud.

source: About Us
et: Meist

source: My Panel
et: Minu paneel

source: Made with
et: Valmistatud

source: for better service
et: parema teeninduse jaoks

source: 123 Service Street, City, State 12345
et: 123 Teenuse tänav, Linn, Maakond 12345

source: Choose a Service Category
et: Valige teenuse kategooria

source: View Services
et: Vaata teenuseid

source: No service categories available
et: Teenuse kategooriaid ei ole saadaval

source: Service categories will be added soon. Please check back later.
et: Teenuse kategooriad lisatakse peagi. Palun kontrollige hiljem uuesti.

source: Provider
et: Osutaja

source: Example Work
et: Näidistöö

source: Example work
et: Näidistöö

source: No services available in this category
et: Selles kategoorias teenuseid ei ole saadaval

source: Services in this category will be added soon. Please check back later.
et: Sellesse kategooriasse lisatakse teenuseid peagi. Palun kontrollige hiljem uuesti.

source: Back to Categories
et: Tagasi kategooriate juurde

source: View My Feedback
et: Vaata minu tagasisidet

source: Status
et: Staatus

source: Feedback
et: Tagasiside

source: Waiting for approval
et: Ootab kinnitust

source: In progress
et: Töös

source: Completed
et: Lõpetatud

source: Service booked successfully! Waiting for admin approval.
et: Teenus broneeritud edukalt! Ootab admini kinnitust.

source: Booking failed. Please try again.
et: Broneerimine ebaõnnestus. Palun proovige uuesti.

source: Service not found.
et: Teenust ei leitud.

source: Browse Services
et: Sirvi teenuseid

source: My Bookings
et: Minu broneeringud

source: Quick Actions
et: Kiirtegevused

source: Booking Statistics
et: Broneeringu statistika

source: Total Bookings
et: Kokku broneeringuid

source: Pending
et: Ootel

source: Approved
et: Kinnitatud

source: Leave Feedback
et: Jäta tagasiside

source: Duration:
et: Kestus:

source: Category:
et: Kategooria:

source: Service is pre-selected based on your choice.
et: Teenus on eelnevalt valitud teie valiku põhjal.

source: Please select your preferred date and time.
et: Palun valige oma eelistatud kuupäev ja kellaaeg.

source: Any special requirements or notes for the service.
et: Erinõuded või märkused teenuse kohta.

source: Confirm Booking
et: Kinnita broneering

source: Booking Information
et: Broneeringu info

source: What's Next?
et: Mis edasi?

source: Submit your booking request
et: Esitage oma broneeringu taotlus

source: Admin reviews and approves your request
et: Admin vaatab läbi ja kinnitab teie taotluse

source: A qualified handyman is assigned
et: Kvalifitseeritud meister määratakse

source: Service is completed
et: Teenus on lõpetatud

source: Need Help?
et: Vajate abi?

source: If you have any questions about this service, please contact our support team.
et: Kui teil on selle teenuse kohta küsimusi, võtke palun ühendust meie tugitiimiga.

source: Reset Your Password
et: Lähtestage oma parool

source: Enter your email address and we will send you a link to reset your password.
et: Sisestage oma e-posti aadress ja me saadame teile lingi parooli lähtestamiseks.

source: Back to Login
et: Tagasi sisselogimisele

source: Reset Password
et: Lähtesta parool

source: Set New Password
et: Määra uus parool

source: Enter your new password below.
et: Sisestage oma uus parool allpool.

source: Welcome back
et: Tere tulemast tagasi

source: Recent Activity
et: Hiljutine tegevus

source: You haven't made any service bookings yet.
et: Te pole veel ühtegi teenuse broneeringut teinud.

source: Preferred Date & Time
et: Eelistatud kuupäev ja kellaaeg

source: Special Requests
et: Erinõuded

source: General
et: Üldine

source: Here are your assigned jobs.
et: Siin on teie määratud tööd.

source: My Assigned Jobs
et: Minu määratud tööd

source: Customer
et: Klient

source: Date
et: Kuupäev

source: None
et: Puudub

source: Start Job
et: Alusta tööd

source: Complete Job
et: Lõpeta töö

source: No jobs assigned yet
et: Töid pole veel määratud

source: You don't have any assigned jobs at the moment.
et: Hetkel pole teil määratud ühtegi tööd.

source: Jobs will appear here once an admin assigns them to you.
et: Tööd ilmuvad siia, kui admin need teile määrab.

source: Approved Jobs
et: Kinnitatud tööd

source: In Progress
et: Töös

source: Earnings
et: Tulud

source: Submit Feedback
et: Esita tagasiside

source: Back to Dashboard
et: Tagasi töölauale

source: Rating
et: Hinne

source: Comment
et: Kommentaar

source: Share your experience with this service...
et: Jagage oma kogemust selle teenusega...

source: Your feedback helps other customers and improves service quality.
et: Teie tagasiside aitab teisi kliente ja parandab teenuse kvaliteeti.

source: Thank you for your feedback!
et: Tänan teie tagasiside eest!

source: You have already left feedback for this booking.
et: Te olete selle broneeringu kohta juba tagasiside jätnud.

source: Access denied.
et: Juurdepääs keelatud.

source: Registration successful! Please login.
et: Registreerimine õnnestus! Palun logige sisse.

source: Login successful!
et: Sisselogimine õnnestus!

source: You have been logged out.
et: Te olete välja logitud.

source: Service added successfully!
et: Teenus lisatud edukalt!

source: Service updated successfully!
et: Teenus uuendatud edukalt!

source: Service deleted successfully!
et: Teenus kustutatud edukalt!

source: Booking approved successfully!
et: Broneering kinnitatud edukalt!

source: Booking declined.
et: Broneering tagasi lükatud.

source: Handyman assigned and booking approved.
et: Meister määratud ja broneering kinnitatud.

source: Booking status updated.
et: Broneeringu staatus uuendatud.

source: Invalid username or password.
et: Vale kasutajanimi või parool.

source: Your handyman account is pending approval by admin.
et: Teie meistri konto ootab admini kinnitust.

source: Username
et: Kasutajanimi

source: Email
et: E-post

source: Password
et: Parool

source: Confirm Password
et: Kinnita parool

source: First Name
et: Eesnimi

source: Last Name
et: Perekonnanimi

source: Phone
et: Telefon

source: I want to register as
et: Ma tahan registreeruda kui

source: Service Provider
et: Teenuseosutaja

source: Plumbing
et: Torutööd

source: Electrical
et: Elektritööd

source: Cleaning
et: Koristamine

source: Gardening
et: Aiatööd

source: Painting
et: Värvimine

source: Carpentry
et: Puusepatööd

source: Other
et: Muu

source: 5 Stars - Excellent
et: 5 tähte - Suurepärane

source: 4 Stars - Very Good
et: 4 tähte - Väga hea

source: 3 Stars - Good
et: 3 tähte - Hea

source: 2 Stars - Fair
et: 2 tähte - Rahuldav

source: 1 Star - Poor
et: 1 täht - Halb

source: Log in to your Service PRO account
et: Logige sisse oma Service PRO kontole

source: Enter your username
et: Sisestage oma kasutajanimi

source: Enter your password
et: Sisestage oma parool

source: Don't have an account?
et: Pole kontot?

source: Sign up here
et: Registreeru siin

source: Create account
et: Loo konto

source: Join Service PRO and connect with trusted professionals
et: Liituge Service PRO-ga ja ühenduge usaldusväärsete professionaalidega

source: Enter your first name
et: Sisestage oma eesnimi

source: Enter your last name
et: Sisestage oma perekonnanimi

source: Choose a username
et: Valige kasutajanimi

source: Enter your email
et: Sisestage oma e-post

source: Enter your phone number
et: Sisestage oma telefoninumber

source: Create a password
et: Loo parool

source: Confirm your password
et: Kinnita oma parool

source: Already have an account?
et: On juba konto?

source: Login here
et: Logi siin sisse

source: Forgot your password?
et: Unustasid parooli?

source: Confirmed
et: Kinnitatud

source: Admin Dashboard
et: Admini töölaud
